# sl = {"Понедельник":1, "Вторник":2, "Среда":3}
# sl["Четверг"]=4
# sl.update({"Пятница":5, "Суббота":6})
# print(sl)

# s = ["Понедельник","Вторник","Среда","Четверг","Пятница","Суббота"]
# ch = [1,2,3,4,5,6]
# sl = {key:value for key,value in zip(s,ch)}
# print(sl)

# sl = {"Понедельник":1,"Вторник":2,"Среда":3}
# print(sl["Вторник"])

# sp = {"Огонь":["Скорпион","Лев"],"Вода":["Водолей","Рыбы"],"Земля":["Блезницы","Рак"],"Воздух":["Рак","Ня"]}
# print(sp["Вода"])
#
# k = "Газ"
# try:
#     print(sp[k])
# except KeyError:
#     print("НЕЕЕ")

# s = sp.get("Огонь")
# print(s)

# s = {123:"Мишка",228:"Медвежонок",1488:"Крыса",67:"Волк"}
# t = s.pop(100,0)
# print(t)

# s = {"Маша":[3,4,5],"Даша":[3,3,4],"Влад":[2,2,5]}
# for i in s.keys():
#     print(i)
# for i in s.values():
#     print(i)
# for i in s.items():
#     print(i)